# Import Modules

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [5]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  9  9  4  3
1  6  8  4  4  7
2  8  7  8  7  7
3  3  4  8  6  5
4  9  8  1  6  4
5  2  6  6  8  5
6  2  6  1  3  6
7  6  4  4  4  6
8  1  6  4  5  9
9  9  8  5  9  4

# Seleksi baris dengan between()

In [5]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
0  2  1  6  4  8
1  4  8  5  3  6
2  3  7  1  8  3
4  3  6  1  1  6
5  4  2  8  6  8
6  5  5  4  8  2
8  2  2  6  6  6
9  4  5  7  2  7

In [7]:
df[df['A'].between(2, 5,inclusive= 'neither')]

   A  B  C  D  E
3  3  4  8  6  5

In [9]:
df[df['A'].between(2, 5, inclusive='left')]

   A  B  C  D  E
0  2  9  9  4  3
3  3  4  8  6  5
5  2  6  6  8  5
6  2  6  1  3  6

In [11]:
df[df['A'].between(2, 5, inclusive='right')]

   A  B  C  D  E
3  3  4  8  6  5

In [13]:
df[df['A'].between(2, 5, inclusive='both')]

   A  B  C  D  E
0  2  9  9  4  3
3  3  4  8  6  5
5  2  6  6  8  5
6  2  6  1  3  6